package collection;


public class CollectionBasic {
    /*
    컬렉션 프레임워크 : 다수의 데이터를 관리하기 위해 자바에서 제공하는 기능 사용
    컬렉션 - 데이터 모음집
    컬렉션 프레임워크에는 기본 자료형 저장 불가(Wrapper 클래스 사용해서 넣어라)

    제공되는 인터페이스
    (자료구제에 따라 데이터의 저장 형태가 달라지기 때문에 4가지 방법을 제공)
    List, Set, Queue, Map

    List 에 저장되는 데이터의 특징 - 데이터의 순번 존재, 데이터의 중복 가능
    Set 에 저장되는 데이터의 특징 - 데이터의 순번 없음, 데이터 중복 불가
    *자료구조 stack - 차례대로 입력하고 역순으로 불러옴(L.I.F.O = 선입후출)
    *자료구조 queue - 차례대로 입력하고 차례대로 불러옴(F.I.F.O = 선입선출)

    List 인터페이스를 구현한 클래스
    - ArrayList : 조회는 빠르나 삭제와 추가는 느림(새로운 배열로 재할당해야하기때문)
    - LinkedList :
    */
}
